export default function projects() {
    return [
        {
            id: 1,
            name: "تغییر نام دهنده سریالی ...",
            slug: "ser-renamer",
            desc: "یه برنامه برای اینکه بتونم وقتی دارم انیمه می بینم یا فیلم می بینم با یه دستکاری ساده توی اسم زیر نویس ها و فیلم ها دیگه مجبور نباشم هر سری زیر نویس رو اضافه کنم و به صورت اتومات اضافه بشه",
            image: "/Renamer/1.jpg",
            reason: "یه روز داشتم انیمه شبدر سیاه رو می دیدم که با خودم گفتم پسر وقتشه زیر نویس دانلود کنم وقتی دانلود شد خواستم اسم هاشو با اسم فیلم یکی کنم که زیر نویس اتومات خودش اضافه بشه اما تنبلیم اومد چون تعداد قسمت ها زیاد بود، پس با سی شارپ یه برنامه ساختم که کارم ساده‌تر بشه",
            problemStatement: "",
            problemStatementImage: "",
            steps: [
                {
                    step_id: 1,
                    step_name: "مرحله اول",
                    step_desc: "ابتدا از گزینه انتخاب آدرس مسیر مورد نظر را انتخاب می‌کنید. در واقع، مسیری که در اون فایل‌ها وجود دارند و نیاز به تغییر اسم دارند. البته می‌توانیم آدرس را کپی کنیم و در این قسمت داخل فیلد مربوطه قرار دهیم.",
                    step_image: "/Renamer/2.jpg",
                },
                {
                    step_id: 2,
                    step_name: "مرحله دوم",
                    step_desc: "یک تعداد فایل ویدئو داریم که با نارنجی نمایش داده شده‌اند و یک آدرس که محل فایل‌ها است. ابتدا آدرس را کپی می‌کنم و در قسمت شماره ۲ یعنی فیلد آدرس قرار می‌دهم و نوع فایل را با توجه به نوع فایل‌ها یعنی mkv انتخاب می‌کنم و بعد دکمه ثبت را می‌زنم که فایل‌ها لیست شوند و در برنامه نگهداری شوند.",
                    step_image: "/Renamer/3.jpg",
                },
                {
                    step_id: 3,
                    step_name: "مرحله سوم",
                    step_desc: "با استفاده از دکمه لیست بررسی باید مطمئن شوم که همه فایل‌ها به ترتیب لیست شده‌اند. جهت اطمینان می‌توانم دکمه مرتب‌سازی خودکار را ابتدا بزنم و بعد لیست بررسی را باز کنم که خود برنامه یک بار همه فایل‌هایم را مرتب کند و بعد در صورت نیاز جای‌شان را تغییر دهم.",
                    step_image: "/Renamer/4.jpg",
                },
                {
                    step_id: 4,
                    step_name: "مرحله چهارم",
                    step_desc: "یکی از اسم زیرنویس‌ها را کپی می‌کنم و مطابق نمونه وارد شده اسم آن را قرار می‌دهم. در نظر داشته باشید که قرار است اسم فیلم‌هایم با اسم زیرنویس‌هایم یکی شود. در شرایط شما ممکن است این عمل برعکس باشد که در مرحله دوم نوع فایل مربوطه را انتخاب کرده‌اید.",
                    step_image: "/Renamer/5.jpg",
                },
                {
                    step_id: 5,
                    step_name: "مرحله پنجم",
                    step_desc: "در اینجا باید دقت کنید که روبروی جایی که می‌خواهید به ترتیب عدد سریال‌ها وارد شود، وقت دیگری عددی ننویسید که بعد مجبور شوید یک بار دیگر نرم‌افزار را اجرا کنید که آن عدد را بردارید. برای همین من از عبارت E استفاده می‌کنم که حواسم باشد بعد از این حرف عدد دیگری وارد نکنم. همچنین، عددی که زیرنویس‌هایم با آن شروع شده مثل عدد ۱ را در قسمت 'شروع از' وارد می‌کنم. شاید زیرنویس شما از قسمت ۷۸ شروع شده باشد که شما باید در اینجا عدد ۷۸ را وارد کنید.",
                    step_image: "/Renamer/6.jpg",
                },
                {
                    step_id: 6,
                    step_name: "مرحله ششم",
                    step_desc: "حالا دکمه تغییر نام را می‌زنیم و یکی دو ثانیه منتظر می‌مانیم که کارش را انجام دهد. دقت کنید که این عملیات غیر قابل بازگشت است، پس مطمئن باشید که همه مراحل بالا را با دقت انجام داده‌اید.",
                    step_image: "/Renamer/7.jpg",
                },
                {
                    step_id: 7,
                    step_name: "مرحله هفتم",
                    step_desc: "می‌بینیم که همه فایل‌های ویدئویی mkv به درستی تغییر نام پیدا کرده‌اند و حالا اگر هر ویدئو را باز کنید، دیگر نیازی نیست که بعد از باز کردنش فایل زیرنویس را به ویدئو اضافه کنید، چون خودش به صورت خودکار اضافه می‌شود.",
                    step_image: "/Renamer/8.jpg",
                },
            ],
        },
    ];
}
